RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/cmsis_drivers/fsl_usart_cmsis.c
static usart_dma_handle_t USART11_DmaHandle;
static dma_handle_t USART11_DmaRxHandle;
static dma_handle_t USART11_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart11_dma_driver_state")
static cmsis_usart_dma_driver_state_t usart11_DmaDriverState = {
#else
static cmsis_usart_dma_driver_state_t usart11_DmaDriverState = {
#endif
    &usart11_Resource, &usart11_DmaResource, &USART11_DmaHandle, &USART11_DmaRxHandle, &USART11_DmaTxHandle,
};

static int32_t USART11_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART11_PIN_INIT
    RTE_USART11_PIN_INIT();
#endif
    return USART_DmaInitialize(cb_event, &usart11_DmaDriverState);
}

static int32_t USART11_DmaUninitialize(void)
{
#ifdef RTE_USART11_PIN_DEINIT
    RTE_USART11_PIN_DEINIT();
#endif
    return USART_DmaUninitialize(&usart11_DmaDriverState);
}

static int32_t USART11_DmaPowerControl(ARM_POWER_STATE state)
{
    return USART_DmaPowerControl(state, &usart11_DmaDriverState);
}

static int32_t USART11_DmaSend(const void *data, uint32_t num)
{
    return USART_DmaSend(data, num, &usart11_DmaDriverState);
}

static int32_t USART11_DmaReceive(void *data, uint32_t num)
{
    return USART_DmaReceive(data, num, &usart11_DmaDriverState);
}

static int32_t USART11_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_DmaTransfer(data_out, data_in, num, &usart11_DmaDriverState);
}

static uint32_t USART11_DmaGetTxCount(void)
{
    return USART_DmaGetTxCount(&usart11_DmaDriverState);
}

static uint32_t USART11_DmaGetRxCount(void)
{
    return USART_DmaGetRxCount(&usart11_DmaDriverState);
}

static int32_t USART11_DmaControl(uint32_t control, uint32_t arg)
{
    return USART_DmaControl(control, arg, &usart11_DmaDriverState);
}

static ARM_USART_STATUS USART11_DmaGetStatus(void)
{
    return USART_DmaGetStatus(&usart11_DmaDriverState);
}

#endif

#else

static usart_handle_t USART11_Handle;
#if defined(USART11_RX_BUFFER_ENABLE) && (USART11_RX_BUFFER_ENABLE == 1)
static uint8_t usart11_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart11_non_blocking_driver_state")
static cmsis_usart_non_blocking_driver_state_t usart11_NonBlockingDriverState = {
#else
static cmsis_usart_non_blocking_driver_state_t usart11_NonBlockingDriverState = {
#endif
    &usart11_Resource,
    &USART11_Handle,
};

static int32_t USART11_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART11_PIN_INIT
    RTE_USART11_PIN_INIT();
#endif
    return USART_NonBlockingInitialize(cb_event, &usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingUninitialize(void)
{
#ifdef RTE_USART11_PIN_DEINIT
    RTE_USART11_PIN_DEINIT();
#endif
    return USART_NonBlockingUninitialize(&usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = USART_NonBlockingPowerControl(state, &usart11_NonBlockingDriverState);
#if defined(USART11_RX_BUFFER_ENABLE) && (USART11_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (usart11_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        USART_TransferStartRingBuffer(usart11_NonBlockingDriverState.resource->base,
                                      usart11_NonBlockingDriverState.handle, usart11_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif
    return result;
}

static int32_t USART11_NonBlockingSend(const void *data, uint32_t num)
{
    return USART_NonBlockingSend(data, num, &usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingReceive(void *data, uint32_t num)
{
    return USART_NonBlockingReceive(data, num, &usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_NonBlockingTransfer(data_out, data_in, num, &usart11_NonBlockingDriverState);
}

static uint32_t USART11_NonBlockingGetTxCount(void)
{
    return USART_NonBlockingGetTxCount(&usart11_NonBlockingDriverState);
}

static uint32_t USART11_NonBlockingGetRxCount(void)
{
    return USART_NonBlockingGetRxCount(&usart11_NonBlockingDriverState);
}

static int32_t USART11_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = USART_NonBlockingControl(control, arg, &usart11_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
#if defined(USART11_RX_BUFFER_ENABLE) && (USART11_RX_BUFFER_ENABLE == 1)
    /* Start receiving interrupts */
    usart11_NonBlockingDriverState.resource->base->FIFOINTENSET |=
        USART_FIFOINTENSET_RXLVL_MASK | USART_FIFOINTENSET_RXERR_MASK;
#endif
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART11_NonBlockingGetStatus(void)
{
    return USART_NonBlockingGetStatus(&usart11_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART11 = {
    USARTx_GetVersion,      USARTx_GetCapabilities,
#if RTE_USART11_DMA_EN
    USART11_DmaInitialize,  USART11_DmaUninitialize, USART11_DmaPowerControl, USART11_DmaSend,    USART11_DmaReceive,
    USART11_DmaTransfer,    USART11_DmaGetTxCount,   USART11_DmaGetRxCount,   USART11_DmaControl, USART11_DmaGetStatus,
#else
    USART11_NonBlockingInitialize,
    USART11_NonBlockingUninitialize,
    USART11_NonBlockingPowerControl,
    USART11_NonBlockingSend,
    USART11_NonBlockingReceive,
    USART11_NonBlockingTransfer,
    USART11_NonBlockingGetTxCount,
    USART11_NonBlockingGetRxCount,
    USART11_NonBlockingControl,
    USART11_NonBlockingGetStatus,
#endif
    USARTx_SetModemControl, USARTx_GetModemStatus};

#endif /* usart11 */

#if defined(USART12) && defined(RTE_USART12) && RTE_USART12

/* User needs to provide the implementation for USART12_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t USART12_GetFreq(void);

static cmsis_usart_resource_t usart12_Resource = {USART12, USART12_GetFreq};

#if defined(RTE_USART12_DMA_EN) && RTE_USART12_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

