RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/cmsis_drivers/fsl_usart_cmsis.c
cmsis_usart_dma_resource_t usart12_DmaResource = {
    RTE_USART12_DMA_TX_DMA_BASE,
    RTE_USART12_DMA_TX_CH,
    RTE_USART12_DMA_RX_DMA_BASE,
    RTE_USART12_DMA_RX_CH,
};

static usart_dma_handle_t USART12_DmaHandle;
static dma_handle_t USART12_DmaRxHandle;
static dma_handle_t USART12_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart12_dma_driver_state")
static cmsis_usart_dma_driver_state_t usart12_DmaDriverState = {
#else
static cmsis_usart_dma_driver_state_t usart12_DmaDriverState = {
#endif
    &usart12_Resource, &usart12_DmaResource, &USART12_DmaHandle, &USART12_DmaRxHandle, &USART12_DmaTxHandle,
};

static int32_t USART12_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART12_PIN_INIT
    RTE_USART12_PIN_INIT();
#endif
    return USART_DmaInitialize(cb_event, &usart12_DmaDriverState);
}

static int32_t USART12_DmaUninitialize(void)
{
#ifdef RTE_USART12_PIN_DEINIT
    RTE_USART12_PIN_DEINIT();
#endif
    return USART_DmaUninitialize(&usart12_DmaDriverState);
}

static int32_t USART12_DmaPowerControl(ARM_POWER_STATE state)
{
    return USART_DmaPowerControl(state, &usart12_DmaDriverState);
}

static int32_t USART12_DmaSend(const void *data, uint32_t num)
{
    return USART_DmaSend(data, num, &usart12_DmaDriverState);
}

static int32_t USART12_DmaReceive(void *data, uint32_t num)
{
    return USART_DmaReceive(data, num, &usart12_DmaDriverState);
}

static int32_t USART12_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_DmaTransfer(data_out, data_in, num, &usart12_DmaDriverState);
}

static uint32_t USART12_DmaGetTxCount(void)
{
    return USART_DmaGetTxCount(&usart12_DmaDriverState);
}

static uint32_t USART12_DmaGetRxCount(void)
{
    return USART_DmaGetRxCount(&usart12_DmaDriverState);
}

static int32_t USART12_DmaControl(uint32_t control, uint32_t arg)
{
    return USART_DmaControl(control, arg, &usart12_DmaDriverState);
}

static ARM_USART_STATUS USART12_DmaGetStatus(void)
{
    return USART_DmaGetStatus(&usart12_DmaDriverState);
}

#endif

#else

static usart_handle_t USART12_Handle;
#if defined(USART12_RX_BUFFER_ENABLE) && (USART12_RX_BUFFER_ENABLE == 1)
static uint8_t usart12_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart12_non_blocking_driver_state")
static cmsis_usart_non_blocking_driver_state_t usart12_NonBlockingDriverState = {
#else
static cmsis_usart_non_blocking_driver_state_t usart12_NonBlockingDriverState = {
#endif
    &usart12_Resource,
    &USART12_Handle,
};

static int32_t USART12_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART12_PIN_INIT
    RTE_USART12_PIN_INIT();
#endif
    return USART_NonBlockingInitialize(cb_event, &usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingUninitialize(void)
{
#ifdef RTE_USART12_PIN_DEINIT
    RTE_USART12_PIN_DEINIT();
#endif
    return USART_NonBlockingUninitialize(&usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = USART_NonBlockingPowerControl(state, &usart12_NonBlockingDriverState);
#if defined(USART12_RX_BUFFER_ENABLE) && (USART12_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (usart12_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        USART_TransferStartRingBuffer(usart12_NonBlockingDriverState.resource->base,
                                      usart12_NonBlockingDriverState.handle, usart12_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif
    return result;
}

static int32_t USART12_NonBlockingSend(const void *data, uint32_t num)
{
    return USART_NonBlockingSend(data, num, &usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingReceive(void *data, uint32_t num)
{
    return USART_NonBlockingReceive(data, num, &usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_NonBlockingTransfer(data_out, data_in, num, &usart12_NonBlockingDriverState);
}

static uint32_t USART12_NonBlockingGetTxCount(void)
{
    return USART_NonBlockingGetTxCount(&usart12_NonBlockingDriverState);
}

static uint32_t USART12_NonBlockingGetRxCount(void)
{
    return USART_NonBlockingGetRxCount(&usart12_NonBlockingDriverState);
}

static int32_t USART12_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = USART_NonBlockingControl(control, arg, &usart12_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
#if defined(USART12_RX_BUFFER_ENABLE) && (USART12_RX_BUFFER_ENABLE == 1)
    /* Start receiving interrupts */
    usart12_NonBlockingDriverState.resource->base->FIFOINTENSET |=
        USART_FIFOINTENSET_RXLVL_MASK | USART_FIFOINTENSET_RXERR_MASK;
#endif
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART12_NonBlockingGetStatus(void)
{
    return USART_NonBlockingGetStatus(&usart12_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART12 = {
    USARTx_GetVersion,      USARTx_GetCapabilities,
#if RTE_USART12_DMA_EN
    USART12_DmaInitialize,  USART12_DmaUninitialize, USART12_DmaPowerControl, USART12_DmaSend,    USART12_DmaReceive,
    USART12_DmaTransfer,    USART12_DmaGetTxCount,   USART12_DmaGetRxCount,   USART12_DmaControl, USART12_DmaGetStatus,
#else
    USART12_NonBlockingInitialize,
    USART12_NonBlockingUninitialize,
    USART12_NonBlockingPowerControl,
    USART12_NonBlockingSend,
    USART12_NonBlockingReceive,
    USART12_NonBlockingTransfer,
    USART12_NonBlockingGetTxCount,
    USART12_NonBlockingGetRxCount,
    USART12_NonBlockingControl,
    USART12_NonBlockingGetStatus,
#endif
    USARTx_SetModemControl, USARTx_GetModemStatus};

#endif /* usart12 */

#if defined(USART13) && defined(RTE_USART13) && RTE_USART13

/* User needs to provide the implementation for USART13_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t USART13_GetFreq(void);

static cmsis_usart_resource_t usart13_Resource = {USART13, USART13_GetFreq};

