RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/cmsis_drivers/fsl_usart_cmsis.c
#if defined(RTE_USART13_DMA_EN) && RTE_USART13_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_usart_dma_resource_t usart13_DmaResource = {
    RTE_USART13_DMA_TX_DMA_BASE,
    RTE_USART13_DMA_TX_CH,
    RTE_USART13_DMA_RX_DMA_BASE,
    RTE_USART13_DMA_RX_CH,
};

static usart_dma_handle_t USART13_DmaHandle;
static dma_handle_t USART13_DmaRxHandle;
static dma_handle_t USART13_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart13_dma_driver_state")
static cmsis_usart_dma_driver_state_t usart13_DmaDriverState = {
#else
static cmsis_usart_dma_driver_state_t usart13_DmaDriverState = {
#endif
    &usart13_Resource, &usart13_DmaResource, &USART13_DmaHandle, &USART13_DmaRxHandle, &USART13_DmaTxHandle,
};

static int32_t USART13_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART13_PIN_INIT
    RTE_USART13_PIN_INIT();
#endif
    return USART_DmaInitialize(cb_event, &usart13_DmaDriverState);
}

static int32_t USART13_DmaUninitialize(void)
{
#ifdef RTE_USART13_PIN_DEINIT
    RTE_USART13_PIN_DEINIT();
#endif
    return USART_DmaUninitialize(&usart13_DmaDriverState);
}

static int32_t USART13_DmaPowerControl(ARM_POWER_STATE state)
{
    return USART_DmaPowerControl(state, &usart13_DmaDriverState);
}

static int32_t USART13_DmaSend(const void *data, uint32_t num)
{
    return USART_DmaSend(data, num, &usart13_DmaDriverState);
}

static int32_t USART13_DmaReceive(void *data, uint32_t num)
{
    return USART_DmaReceive(data, num, &usart13_DmaDriverState);
}

static int32_t USART13_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_DmaTransfer(data_out, data_in, num, &usart13_DmaDriverState);
}

static uint32_t USART13_DmaGetTxCount(void)
{
    return USART_DmaGetTxCount(&usart13_DmaDriverState);
}

static uint32_t USART13_DmaGetRxCount(void)
{
    return USART_DmaGetRxCount(&usart13_DmaDriverState);
}

static int32_t USART13_DmaControl(uint32_t control, uint32_t arg)
{
    return USART_DmaControl(control, arg, &usart13_DmaDriverState);
}

static ARM_USART_STATUS USART13_DmaGetStatus(void)
{
    return USART_DmaGetStatus(&usart13_DmaDriverState);
}

#endif

#else

static usart_handle_t USART13_Handle;
#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
static uint8_t usart13_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart13_non_blocking_driver_state")
static cmsis_usart_non_blocking_driver_state_t usart13_NonBlockingDriverState = {
#else
static cmsis_usart_non_blocking_driver_state_t usart13_NonBlockingDriverState = {
#endif
    &usart13_Resource,
    &USART13_Handle,
};

static int32_t USART13_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART13_PIN_INIT
    RTE_USART13_PIN_INIT();
#endif
    return USART_NonBlockingInitialize(cb_event, &usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingUninitialize(void)
{
#ifdef RTE_USART13_PIN_DEINIT
    RTE_USART13_PIN_DEINIT();
#endif
    return USART_NonBlockingUninitialize(&usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = USART_NonBlockingPowerControl(state, &usart13_NonBlockingDriverState);
#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (usart13_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        USART_TransferStartRingBuffer(usart13_NonBlockingDriverState.resource->base,
                                      usart13_NonBlockingDriverState.handle, usart13_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif
    return result;
}

static int32_t USART13_NonBlockingSend(const void *data, uint32_t num)
{
    return USART_NonBlockingSend(data, num, &usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingReceive(void *data, uint32_t num)
{
    return USART_NonBlockingReceive(data, num, &usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_NonBlockingTransfer(data_out, data_in, num, &usart13_NonBlockingDriverState);
}

static uint32_t USART13_NonBlockingGetTxCount(void)
{
    return USART_NonBlockingGetTxCount(&usart13_NonBlockingDriverState);
}

static uint32_t USART13_NonBlockingGetRxCount(void)
{
    return USART_NonBlockingGetRxCount(&usart13_NonBlockingDriverState);
}

static int32_t USART13_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = USART_NonBlockingControl(control, arg, &usart13_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
    /* Start receiving interrupts */
    usart13_NonBlockingDriverState.resource->base->FIFOINTENSET |=
        USART_FIFOINTENSET_RXLVL_MASK | USART_FIFOINTENSET_RXERR_MASK;
#endif
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART13_NonBlockingGetStatus(void)
{
    return USART_NonBlockingGetStatus(&usart13_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART13 = {
    USARTx_GetVersion,      USARTx_GetCapabilities,
#if RTE_USART13_DMA_EN
    USART13_DmaInitialize,  USART13_DmaUninitialize, USART13_DmaPowerControl, USART13_DmaSend,    USART13_DmaReceive,
    USART13_DmaTransfer,    USART13_DmaGetTxCount,   USART13_DmaGetRxCount,   USART13_DmaControl, USART13_DmaGetStatus,
#else
    USART13_NonBlockingInitialize,
    USART13_NonBlockingUninitialize,
    USART13_NonBlockingPowerControl,
    USART13_NonBlockingSend,
    USART13_NonBlockingReceive,
    USART13_NonBlockingTransfer,
    USART13_NonBlockingGetTxCount,
    USART13_NonBlockingGetRxCount,
    USART13_NonBlockingControl,
    USART13_NonBlockingGetStatus,
#endif
    USARTx_SetModemControl, USARTx_GetModemStatus};

#endif /* usart13 */
